
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Sadan007/aws-ecs-terraform/actions/runs/10418348213)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a726dad91e2c9a43]
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-058c61c0fe3f48cc1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-060b91e1c5ec3e65f]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:targetgroup/go-simple-server-target-group/b3e2b4cb85745bb1]
aws_security_group.alb: Refreshing state... [id=sg-0ff7655b17cc3a3f9]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c5d11a0a677e1b4c]
aws_security_group.ecs: Refreshing state... [id=sg-018a893363feab386]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-041c0425ad133aefd]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c67bfda6fb6fef21]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05837b8127ff91859]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08282f6d6e0448d3c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c3f91372e6601353]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ecedb81531f5bfb9]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06732e9368ffd743d]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0b968489362f876c0]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1024711945]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c0ae7c419713d251]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03b25e371661fca6f]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:loadbalancer/app/go-simple-server-alb/c249f93de79a7960]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c67bfda6fb6fef211080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0257f5d9e381fad51]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0633b7623b84469b2]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e6b3e2e7e6b89e60]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0763d8082241fe266]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-03f5b332d6628447c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0b827f5e0430e0560]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06732e9368ffd743d1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0b968489362f876c01080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:listener/app/go-simple-server-alb/c249f93de79a7960/01c35c30ac2e05aa]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:listener-rule/app/go-simple-server-alb/c249f93de79a7960/01c35c30ac2e05aa/21979f97dfd80197]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)

      + setting (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:targetgroup/go-simple-server-target-group/b3e2b4cb85745bb1"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-018a893363feab386",
            ]
          + subnets          = [
              + "subnet-041c0425ad133aefd",
              + "subnet-05837b8127ff91859",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs: Creation complete after 1s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role.ecs_task: Creation complete after 1s [id=go-simple-server-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20240816101427659400000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 2s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:222433988246:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:222433988246:service/go-simple-server/go-simple-server]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":20,"Program":"tfcmt","SHA1":"82139921c0261b82c94c86ed19298bfad86ba738","Vars":{},"WorkflowName":"Terraform"} -->